Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: An L</argument>-passing mechanism in which the L</formal arguments> refer to a copy of the L</actual arguments>, and the L</subroutine> cannot change the actual arguments by changing the formal arguments.
es: Mecanismo para pasar L</argumentos> en el que los L</argumentos formales> hacen referencia a los L</argumentos reales> y la L</subrutina> no puede cambiar los argumentos reales modificando los argumentos formales.

source: An L</assertion> that peeks at the string to the left of the current match location.
es: L<Aserción|/aserción> que mira a la cadena situada a la izquierda de la posición de detección actual.

source: An L</assertion> that peeks at the string to the right of the current match location.
es: L<Aserción|/aserción> que mira a la cadena situada a la derecha de la posición de detección actual.

source: An L</assertion> that states something exists and perhaps describes what it's like, without giving any commitment as to how or where you'll use it.
es: L<Aserción|/aserción> que declara que algo existe y que también puede describir cómo es, sin especificar cómo o dónde se va a usar.

source: An L</attribute> of an L</object>; data stored with the particular object rather than with the class as a whole.
es: L<Atributo|/atributo> de un L</objeto>; datos almacenados en un objeto concreto, no en la clase como un todo.

source: An L</expression> that evaluates to something that can be used as a L</filehandle>: a L</string> (filehandle name), a L</typeglob>, a typeglob L</reference>, or a low-level L</IO> object.
es: L<Expresión|/expresión> que, al evaluarse, devuelve algo que se puede usar como L</identificador de archivo>: una L</cadena> (nombre de identificador de archivo), un L</typeglob>, una L</referencia> de typeglob, o un objeto L</IO> de bajo nivel.

source: An L</expression> that yields a L</value> that an L</operator> operates on.
es: L<Expresión|/expresión> que devuelve un L</valor> sobre el que actúa un L</operador>.

source: An L</increment> operator that knows how to bump up alphabetics as well as numbers.
es: Operador de L<incremento|/incrementar> que sabe cómo recorrer los caracteres alfabéticos y los números.

source: An L</instance> of a L</class>.
es: L<Instancia|/instancia> de una L</clase>.

source: An L</lvaluable> function or expression is one to which a value may be assigned, as in C<pos($x) = 10>.
es: Una función o expresión L</compatible con valores-izquierda> permite que se le asignen valores (por ejemplo, C<pos($x) = 10>).

source: An L</operator> taking three L<operands|/operand>.
es: L<Operador|/operador> que consume tres L<operandos|/operando>.

source: An L</operator> that comes in between its L<operands|/operand>, such as multiplication in C<24 * 7>.
es: L<Operador|/operador> que se usa entre sus L<operandos|/operando>, como el de multiplicación en C<24 * 7>.

source: An L</operator> that does something with a list of values, such as L<join|perlfunc/join> or L<grep|perlfunc/grep>.
es: L<Operador|/operador> como L<join|perlfunc/join> o L<grep|perlfunc/grep>, que hace algo con una lista de valores.

source: An L</operator> that follows its L</operand>, as in C<$x++>.
es: L<Operador|/operador> que sigue a su L</operando>, como en C<$x++>.

source: An L</operator> that looks something like a L</literal>, such as the output-grabbing operator, C<`>I<C<command>>C<`>.
es: L<Operador|/operador> que se parece a un L</literal>, como el operador de recolección de salida, C<`>I<C<comando>>C<`>.

source: An L</operator> that precedes its L</operand>, as in C<++$x>.
es: L<Operador|/operador> que precede a su L</operando>, como en C<++$x>.

source: An L</operator> that says whether a particular ordering relationship is L</true> about a pair of L<operands|/operand>.
es: L<Operador|/operador> que indica si una relación de orden concreta es L<verdadera|/verdadero> para un par de L<operandos|/operando>.

source: An L</operator> that surrounds its L</operand>, like the angle operator, or parentheses, or a hug.
es: L<Operador|/operador> que rodea al L</operando>, como el operador de corchetes angulares o los paréntesis, o un abrazo.

source: An L</operator> that takes two L<operands|/operand>.
es: L<Operador|/operador> que consume dos L<operandos|/operando>.

source: An L</operator> whose assigned mission in life is to change the value of a L</variable>.
es: L<Operador|/operador> cuya misión en la vida es cambiar el valor de una L</variable>.

source: An accessor lets you add additional code around attribute access.
es: Un método de acceso permite agregar código adicional para controlar el acceso a los atributos.

source: An actual piece of data, in contrast to all the variables, references, keys, indexes, operators, and whatnot that you need to access the value.
es: Elemento de datos real, en contraste con todas las variables, referencias, claves, índices, operadores, etc. que se necesitan para acceder al valor.

source: An adjectival pseudofunction that warps the meaning of an L</lvalue> in some declarative fashion.
es: Seudofunción de adjetivación que modifica el significado de un L</valor-izquierda> de alguna manera declarativa.

source: An alternate filename that points to the real L</filename>, which in turn points to the real L</file>.
es: Nombre de archivo alternativo que apunta al L</nombre de archivo> real, que a su vez apunta al L</archivo> real.

source: An alternative way of writing something more easily; a shortcut.
es: Forma alternativa y más sencilla de escribir algo; un método abreviado.

source: An archaic expression for what is more correctly referred to as L</list context>.
es: Expresión arcaica que se usa para designar algo cuyo nombre correcto es L</contexto de lista>.

source: An array can be accessed one scalar at a time by specifying a dollar sign (C<$>), then the name of the array (without the leading C<@>), then the subscript inside square brackets.
es: Se puede acceder a un array de escalar en escalar, especificando un signo dólar (C<$>) seguido del nombre del array (sin el signo C<@> inicial) y el subíndice entre corchetes.

source: An array represents a list of values:
es: Un array representa una lista de valores:

source: An array with multiple subscripts for finding a single element.
es: Array en el que cada elemento individual se localiza mediante varios subíndices.

source: An atomic operation is an action that can't be interrupted, not one forbidden in a nuclear-free zone.
es: Una operación atómica es una acción que no se puede interrumpir; no debe confundirse con una acción prohibida en una región libre de armas nucleares.

source: An attribute is a piece of data belonging to a particular object.
es: Un atributo es un elemento de información que pertenece a un objeto específico.

source: An effect similar to C<< (?>pattern) >> may be achieved by writing C<(?=(pattern))\g{-1}>.
es: Se puede lograr un efecto similar al de C<< (?>patrón) >> con C<(?=(patrón))\g{-1}>.

source: An eighth of a L</byte> or of a dollar.
es: Un octavo de un L</byte> o de un dólar.

source: An enchantment, illusion, phantasm, or jugglery.
es: Un encantamiento, una ilusión, un fantasma o juegos malabares.

source: An endpoint for network communication among multiple L<processes|/process> that works much like a telephone or a post office box.
es: Extremo para comunicación de red entre varios L<procesos|/proceso> que representa un papel parecido al de un teléfono o un apartado de correos.

source: An entire computer program crammed into one line of text.
es: En inglés se llama I<one-liner>. Es un programa informático completo embutido en una sola línea de texto.

source: An event that causes a L</handler> to be run.
es: Evento que hace que se ejecute un L</controlador>.

source: An example script is F<Porting/bisect-example.sh>, which you should copy B<outside> of the repository, as the bisect process will reset the state to a clean checkout as it runs.
es: Se proporciona un script de ejemplo, F<Porting/bisect-example.sh>, que debe copiar B<fuera> del repositorio, ya que al ejecutar el proceso de bisección restablece el estado a una copia limpia.

source: An example of how this might be used is as follows:
es: Un ejemplo de cómo se podría usar esto:

source: An exception to this is that you may assign to C<undef> in a list.
es: Una excepción a esto es que se puede asignar a C<undef> en una lista.

source: An exception would be if two modules each tried to C<use> each other, and each also called a function from that other module.
es: Puede producirse una excepción cuando dos módulos intentan usarse mutuamente mediante C<use> y a la vez cada uno llama a una función del otro módulo.

source: An exhaustive treatise on one narrow topic, something of a super-L</FAQ>.
es: Un tratado exhaustivo sobre un tema que no da para mucho, como unas súper-L</P+F>.

source: An expression which, when its value changes, causes a breakpoint in the Perl debugger.
es: Expresión que, al cambiar de valor, activa un punto de interrupción en el depurador de Perl.

source: An external L</subroutine> defined in L</XS>.
es: L<Subrutina|/subrutina> externa definida en L</XS>.

source: An identifier (not necessarily related to the real name of a file) that represents a particular instance of opening a file until you close it.
es: Identificador (no necesariamente relacionado con el nombre real del archivo) que representa una instancia concreta de un archivo abierto hasta que lo cierre.

source: An inner block may countermand this by saying C<no strict 'subs'>.
es: En un bloque interno se puede revocar esto mediante C<no strict 'subs'>.

source: An inside-out object stores its data outside of the object's reference, indexed on a unique property of the object, such as its memory address, rather than in the object itself.
es: Un objeto I<inside-out> almacena sus datos fuera de la referencia del objeto indexados mediante una propiedad única del objeto (como su dirección de memoria), en lugar de almacenarlos en el propio objeto.

source: An instance of a running program.
es: Instancia de un programa en ejecución.

source: An integer divisor when you're interested in the remainder instead of the quotient.
es: Divisor entero que se puede usar cuando se desea obtener el resto en lugar del cociente.

source: An integer in the range from 0 to 1, inclusive.
es: Entero en el intervalo de 0 a 1, ambos incluidos.

source: An internal "code value" typedef, holding a L</subroutine>.
es: Definición de tipo de valor de código ("code value") interno que contiene una L</subrutina>.

source: An internal "glob value" typedef, holding a L</typeglob>.
es: Definición de tipo de "glob value" (valor de glob) interno que contiene un L</typeglob>.

source: An internal I/O object.
es: Objeto de E/S interno.

source: An internal representation of your program wherein lower-level L<constructs|/construct> dangle off the higher-level constructs enclosing them.
es: Representación interna del programa en la que las L<construcciones|/construcción-construir> de bajo nivel cuelgan de las construcciones de nivel más alto que las contienen.

source: An internal shorthand for a "push-pop" code, that is, C code implementing Perl's stack machine.
es: Abreviatura interna de código "push-pop", es decir, el código C que implementa la pila de Perl.

source: An object can be thought of as a noun (a person, a web service, a computer).
es: Un objeto puede verse como un nombre (una persona, un servicio web, un PC...).

source: An object is simply a data structure that knows to which class it belongs.
es: Un objeto es simplemente una estructura de datos que sabe a qué clase pertenece.

source: An object represents a single discrete thing.
es: Representa una única cosa.

source: An object's data is called B<attributes>, and its subroutines are called B<methods>.
es: Los datos de un objeto se denominan B<atributos> y las subrutinas se denominan B<métodos>.

source: An operator with only one L</operand>, like C<!> or L<chdir|perlfunc/chdir>.
es: Operador que se aplica a un solo L</operando>, como C<!> o L<chdir|perlfunc/chdir>.

source: An option on a pattern or substitution, such as C</i> to render the pattern case insensitive.
es: Opción de un patrón o sustitución, como C</i>, que hace que no se distingan mayúsculas de minúsculas en el patrón.

source: An option you give on a command line to influence the way your program works, usually introduced with a minus sign.
es: Opción de línea de comandos que influye en el funcionamiento de un programa. Generalmente se especifica con un signo menos delante.

source: An optional part of a L</subroutine> declaration telling the Perl compiler how many and what flavor of arguments may be passed as L</actual arguments>, so that you can write subroutine calls that parse much like built-in functions.
es: Parte opcional de una declaración de L</subrutina> que indica al compilador de Perl cuántos argumentos y de qué tipo se pueden pasar como L</argumentos reales>, a fin de poder escribir llamadas a subrutinas que se analizan de forma similar a las funciones predefinidas.

source: An ordered sequence of L<values|/value>, stored such that you can easily access any of the values using an integer L</subscript> that specifies the value's L</offset> in the sequence.
es: Secuencia ordenada de L<valores|/valor>, almacenados de forma que se pueda acceder a cualquiera de esos valores mediante un L</subíndice> entero que especifique la L<posición|/desplazamiento> del valor en la secuencia.

source: An ordered set of scalar values.
es: Conjunto ordenado de valores escalares.

source: An uncaught L</exception>, which causes termination of the L</process> after printing a message on your L</standard error> stream.
es: Una L</excepción> no capturada que hace que el L</proceso> finalice tras imprimir un mensaje en la secuencia de L</error estándar>.

source: An unnamed list of temporary scalar values that may be passed around within a program from any list-generating function to any function or construct that provides a L</list context>.
es: Lista sin nombre de valores escalares temporales que se puede pasar en un programa desde cualquier función que genere listas a cualquier función o construcción que proporcione un L</contexto de lista>.

source: An unordered association of L</key>/L</value> pairs, stored such that you can easily use a string L</key> to look up its associated data L</value>.
es: Asociación de pares L</clave>-L</valor> sin ordenar, almacenados de forma que se pueda usar fácilmente una L</clave> de tipo cadena para buscar el L</valor> de datos asociado.

source: And C<$^N> contains whatever was matched by the most-recently closed group (submatch).
es: Y C<$^N> contiene el fragmento capturado (subcoincidencia) por el grupo de captura más reciente.

source: And Larry will sleep easier, too--Wall Street programs not withstanding.
es: Larry también dormirá mejor (si logra no pensar en los programas que se crean para Wall Street).

source: And finally we'll test that we don't make Unicode strings if C<U> is B<not> the first active format:
es: Por último, vamos a comprobar que no creamos cadenas Unicode si C<U> B<no> es el primer formato activo:

source: And if it is interpolated into a larger regex, the original's rules continue to apply to it, and only it.
es: Y si se interpola en una expresión regular más grande, las normas originales se siguen aplicando a esta expresión regular (y solo a ella).

source: And if the protocol you're using supports a way of letting the recipient know which character encoding you used, please help the receiving end by using that feature!
es: Y si el protocolo utilizado ofrece alguna manera de indicar al destinatario la codificación de caracteres utilizada, es muy recomendable hacerlo.

source: And if there are multiple ways it might succeed, you need to understand backtracking to know which variety of success you will achieve.
es: Y si puede coincidir de varias maneras, debe saber cómo funciona la vuelta atrás para entender qué variedad de coincidencia va a obtener.

source: And if you used C<*>'s in the internal groups instead of limiting them to 0 through 5 matches, then it would take forever--or until you ran out of stack space.
es: Y si utiliza algún C<*> en los grupos internos en lugar de limitarlos a un número de coincidencias entre 0 y 5, se ejecutará indefinidamente, hasta que se agote el espacio de pila.

source: And if you want to update your remote-tracking branches for all defined remotes simultaneously you can do
es: Y si desea actualizar las ramas de seguimiento remoto para todos los repositorios remotos definidos simultáneamente, puede ejecutar:

source: And just before we start the loop, we'll set C<patcopy> to be the start of C<pat>:
es: Justo antes de empezar el bucle, se establece C<patcopy> como comienzo de C<pat>:

source: And most of all, it must be something decodable.
es: También es fundamental que lo que se va a descodificar sea descodificable

source: And note that C</x> doesn't affect space interpretation within a single multi-character construct.
es: Y tenga en cuenta que C</x> no afecta a la interpretación de los espacios dentro de una construcción multicarácter.

source: And pull new changes from the repository, and update your local repository (must be clean first)
es: Para incorporar cambios nuevos del repositorio y actualizar su repositorio local (antes debe limpiarlo)

source: And so on.
es: Y así sucesivamente.

source: And some of those digits look like some of the 10 ASCII digits, but mean a different number, so a human could easily think a number is a different quantity than it really is.
es: Y algunas de esas cifras se parecen a algunos de los 10 dígitos ASCII, pero se refieren a un número diferente, por lo que un ser humano podría pensar que un número se refiere a una cantidad distinta de la real.

source: And the tables used by hashes (sometimes called "associative arrays") grow as necessary to prevent degraded performance.
es: Y las tablas usadas por los hashes (a veces denominados "arrays asociativos") se expanden cuando es necesario para que el rendimiento no se vea afectado.

source: And then push back to the repository:
es: Y después enviar los cambios al repositorio:

# And therefore before any CHECK blocks. "
source: And therefore before any CHECK blocks.\n"
es: Y, por tanto, antes que los bloques CHECK.\n"

source: And you can see the changes:
es: Y puede ver los cambios:

source: And you can see the commits:
es: Y puede ver las confirmaciones:

source: And, C<\d+>, may match strings of digits that are a mixture from different writing systems, creating a security issue.
es: Y C<\d+> puede detectar coincidencias en cadenas de dígitos que son una mezcla de diferentes sistemas de escritura, lo que crea un problema de seguridad.

source: Andy 5.000a 1994-Dec-19 5.000b 1995-Jan-18 5.000c 1995-Jan-18 5.000d 1995-Jan-18 5.000e 1995-Jan-18 5.000f 1995-Jan-18 5.000g 1995-Jan-18 5.000h 1995-Jan-18 5.000i 1995-Jan-26 5.000j 1995-Feb-07 5.000k 1995-Feb-11 5.000l 1995-Feb-21 5.000m 1995-Feb-28 5.000n 1995-Mar-07 5.000o 1995-Mar-13?
es: Andy 5.000a 1994-Dic-19 5.000b 1995-Ene-18 5.000c 1995-Ene-18 5.000d 1995-Ene-18 5.000e 1995-Ene-18 5.000f 1995-Ene-18 5.000g 1995-Ene-18 5.000h 1995-Ene-18 5.000i 1995-Ene-26 5.000j 1995-Ene-07 5.000k 1995-Feb-11 5.000l 1995-Feb-21 5.000m 1995-Feb-28 5.000n 1995-Mar-07 5.000o ¿1995-Mar-13?

source: Andy 5.000a11a 1994-Jul-07 To fit 14.
es: Andy 5.000a11a 1994-Jul-07 Para ajustar a 14.

source: Andy 5.000a12a 1994-Aug-08 5.000a12b 1994-Aug-15 5.000a12c 1994-Aug-22 5.000a12d 1994-Aug-22 5.000a12e 1994-Aug-22 5.000a12f 1994-Aug-24 5.000a12g 1994-Aug-24 5.000a12h 1994-Aug-24
es: Andy 5.000a12a 1994-Ago-08 5.000a12b 1994-Ago-15 5.000a12c 1994-Ago-22 5.000a12d 1994-Ago-22 5.000a12e 1994-Ago-22 5.000a12f 1994-Ago-24 5.000a12g 1994-Ago-24 5.000a12h 1994-Ago-24

source: Andy 5.000alpha8 1994-Apr-04
es: Andy 5.000alpha8 1994-Abr-04

source: Andy 5.001a 1995-Mar-15 5.001b 1995-Mar-31 5.001c 1995-Apr-07 5.001d 1995-Apr-14 5.001e 1995-Apr-18 Stable.
es: Andy 5.001a 1995-Mar-15 5.001b 1995-Mar-31 5.001c 1995-Abr-07 5.001d 1995-Abr-14 5.001e 1995-Abr-18 Estable.

source: Andy 5.002b1h 1996-Jan-05 5.002b2 1996-Jan-14
es: Andy 5.002b1h 1996-Ene-05 5.002b2 1996-Ene-14

source: Andy 5.003_03 1996-Aug-28 5.003_04 1996-Sep-02 5.003_05 1996-Sep-12 5.003_06 1996-Oct-07 5.003_07 1996-Oct-10
es: Andy 5.003_03 1996-Ago-28 5.003_04 1996-Sep-02 5.003_05 1996-Sep-12 5.003_06 1996-Oct-07 5.003_07 1996-Oct-10

source: Annotated tags in the canonical perl.git repository will never be deleted or modified.
es: Las etiquetas con anotaciones del repositorio perl.git canónico nunca se eliminarán ni modificarán.

source: Another bug involves character classes that match both a sequence of multiple characters, and an initial sub-string of that sequence.
es: Otro error está relacionado con clases de caracteres que coinciden tanto con una secuencia de caracteres múltiples como con una subcadena inicial de esa secuencia.

source: Another common way to create a similar cycle is with the looping modifier C<//g>:
es: Otra forma común de crear un ciclo similar es usar el modificador de bucle C<//g>:

source: Another description starts with notions of "better"/"worse".
es: Otra descripción empieza por los conceptos de "mejor"/"peor".

source: Another mnemonic for this modifier is "Depends", as the rules actually used depend on various things, and as a result you can get unexpected results.
es: Otra regla mnemotécnica para este modificador es "Depende", ya que las reglas utilizadas realmente dependen de varias cosas, y como consecuencia se pueden obtener resultados inesperados.

source: Another name for L</code point>
es: Otro nombre para L</código de carácter>

source: Another term for a setter is B<mutator>
es: Un método I<setter> también se puede llamar B<mutator> (modificador).

source: Another use for typeglobs is to pass filehandles into a function or to create new filehandles.
es: Otro uso de los typeglobs es pasar identificadores de archivo a una función o crear nuevos identificadores de archivo.

source: Another use of symbol tables is for making "constant" scalars.
es: Otro uso de la tabla de símbolos consiste en crear escalares "constantes".

source: Another way to create anonymous filehandles is with the Symbol module or with the IO::Handle module and its ilk.
es: Otra forma de crear identificadores de archivo anónimos es usar el módulo Symbol o IO::Handle y sus acólitos.

source: Any part of your code which you can isolate and extract and plug into something else is a likely candidate.
es: También son buenos candidatos los fragmentos de código que pueda aislar y extraer para conectarlos a otro componente.

source: Any subroutine that blesses a data structure into a class is a valid constructor in Perl.
es: Cualquier subrutina que bendiga una estructura de datos en una clase es un constructor válido en Perl.

source: Any L</class method>, instance L</method>, or L</subroutine> that composes, initializes, blesses, and returns an L</object>.
es: Cualquier L</método de clase>, L</método> de instancia o L</subrutina> que forma, inicializa, bendice y devuelve un L</objeto>.

source: Any attempt to do so will result in git producing an error like this:
es: Si se intenta eliminar una de estas ramas, git generará un error parecido al siguiente:

source: Any following text is ignored.
es: Se omitirá el texto que haya a continuación.

source: Any large IRC network (Dalnet, EFnet) is also likely to have a #perl channel, with varying activity levels.
es: Es probable que también encuentre un canal #perl en cualquiera de las grandes redes de IRC (DALnet, EFnet), con distintos niveles de actividad.
